# Pandas - loc & iloc

In [2]:
import pandas as pd

pandas.dataset.iloc[row, column] - is one of the ways to selecte rows and columns from Panda DataFrame

In [11]:
# Creating a DataFrame
data = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30],
  "qualified": [True, False, False],
  "gender": ["M", "F", "M"]  
}
idx = ["X", "Y", "Z"]

df = pd.DataFrame(data, index=idx)
df

    name  age  qualified gender
X  Sally   50       True      M
Y   Mary   40      False      F
Z   John   30      False      M

### loc[indexes, columns]

#### Selecting rows

In [12]:
out1 = df.loc['X']
out1

name         Sally
age             50
qualified     True
gender           M
Name: X, dtype: object

In [13]:
type(out1)

pandas.core.series.Series

In [14]:
out2 = df.loc['X':'Y']
out2

    name  age  qualified gender
X  Sally   50       True      M
Y   Mary   40      False      F

In [15]:
type(out2)

pandas.core.frame.DataFrame

#### Selecting rows & columns

In [16]:
out3 = df.loc['X':'Y', 'age']
out3

X    50
Y    40
Name: age, dtype: int64

In [17]:
out3 = df.loc['X':'Y', ['name', 'age', 'gender']]
out3

    name  age gender
X  Sally   50      M
Y   Mary   40      F

In [6]:
dict = {'A' : [1 ,2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'], 'NUM': [100, 200, 300, 400, 500 ]}
df1 = pd.DataFrame(dict)
df1

   A  B  NUM
0  1  a  100
1  2  b  200
2  3  c  300
3  4  d  400
4  5  e  500

#### iloc[row_nb, col_nb] - to select rows

In [9]:
i0 = df1.iloc[0] # returns row with index 0 as pdSeries object
print(type(i0))
print(i0)

<class 'pandas.core.series.Series'>
A        1
B        a
NUM    100
Name: 0, dtype: object

In [14]:
out = df1.iloc[3:] # returns all rows with index >= 3
out

   A  B  NUM
3  4  d  400
4  5  e  500

In [15]:
out = df1.iloc[:3] # returns all rows with index < 3
out

   A  B  NUM
0  1  a  100
1  2  b  200
2  3  c  300

In [16]:
out = df1.iloc[:, :2] # returns all rows and columns with index < 2
out

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

In [17]:
out = df1.iloc[2:, 1:2] # returns rows >= 2 and columns with index >= 1 & index < 2 
out

   B
2  c
3  d
4  e